{
    "nodes": [
        {
            "id": 0,
            "article_id": "ART001652144",
            "title_ko": "이동 P2P 네트워크 환경에서 효율적인 연속 범위 질의 처리 기법",
            "author_name": "임종태,박용훈,복경수,유재수",
            "author_id": "CRT001481654,CRT001285217,CRT000302588,CRT000300473",
            "journal_name": "한국 정보 과학회",
            "pub_year": 2012,
            "citation": 3,
            "category": "AI",
            "abstract_ko": "최근 모바일 기기의 보급이 확산되면서 서버-클라이언트의 문제점을 해결하기 위해 P2P 기반 서비스가 연구되기 시작하였다. 본 논문에서는 이동 P2P 기반의 서비스를 위한 효율적인 연속 범위 질의 처리 기법을 제안한다. 제안하는 기법은 질의 배포 과정과 실제 질의를 처리하거나 변경된 질의 결과를 반영하는 과정으로 이루어진다. 질의 배포는 질의 결과에 영향을 미칠 가능성이 있는 모든 피어들에게 배포한다. 질의를 수신한 피어들은 스스로 어떤 질의에 영향을 미치는지를 계산하고 모니터링을 수행한다. 제안하는 기법에서는 질의 피어와 질의를 수신한 피어의 벡터 값을 이용하여 결과가 갱신되는 시점을 미리 계산하기 때문에 효율적으로 질의 결과를 갱신한다. 제안하는 기법의 우수성을 증명하기 위해 기본 기법과의 성능평가를 수행한다.",
            "size": 15
        },
        {
            "id": 1,
            "article_id": "ART001652135",
            "title_ko": "OTP를 활용한 안전하고 간편한 신결제 시스템 연구",
            "author_name": "유순덕",
            "author_id": "CRT001494779",
            "journal_name": "한국 정보 과학회",
            "pub_year": 2012,
            "citation": 2,
            "category": "DB",
            "abstract_ko": "시장은 급속도로 바뀌는 결제수단에 대해 새로운 요구사항이 등장하고 있으며 이를 반영하기 위해 기업은 지속적으로 새로운 결제수단에 대해 고민을 하고 있다. 본 연구는 전자결제 시스템에 이용되는 거래수단 및 지불방법을 살펴보고 신용카드, 계좌이체, 가상계좌, 휴대폰 등 각종 수단의 특징을 비교하였다. 지불결제의 방법적 측면에서는 새롭게 조명되고 있는 페이팔과 체크아웃 시스템에 대하여 살펴본다. 두 시스템의 특징은 아이디와 비밀번호를 활용하여 쉽게 결제를 할 수 있도록 지원하고 있다. 본 연구는 국내시장에서 소액결제시 각종 정보를 결제 시 마다 입력해야 하는 방식에서 탈피해 사용이 편리한 방식으로 OTP를 활용한 신결제시스템에 대하여 소개하고자 한다. 신결제시스템은 ID와 비밀번호, OTP(One Time Password)를 연동한 방식을 활용하여 전자결제를 진행하며 결제시마다 고객이 입력하는 카드정보 공개 및 공유에 따른 보안을 강화하고 있다. 즉 기존 방식대비 사용이 간편하고 소액결제시(300,000원이하) 마다 각종 정보를 입력하지 않아 상대적으로 보안이 우수하다. 신결제 방식(시스템)의 기대효과는 온라인 거래에서 발생하는 전자결제 서비스의 새로운 기술과 서비스를 시장에 공급하여 관련시장의 활성화를 제공하는 것이다. 본 서비스의 활성화와 더불어 다른 형태의 서비스와 연관성을 검토하는 것은 향후 연구과제로 남아있다.",
            "size": 30
        },{
            "id": 2,
            "article_id": "ART001652148",
            "title_ko": "전통적 모자익 패턴을 사용한 영상 모자익 생성",
            "author_name": "윤종철,이인권",
            "author_id": "CRT000460253,CRT000297940",
            "journal_name": "한국 정보 과학회",
            "pub_year": 2012,
            "citation": 0,
            "category": "AI",
            "abstract_ko": "본 논문은 전통적인 모자익 타일링 기법을 기반으로 하여 영상의 영역별로 선택적인 타일링이 이루어지는 영상 모자익 스타일화 기법을 제안한다. 고대로부터 사용되어온 전통적인 3가지 모자익 패턴을 사용하여 영상의 균일성 및 방향성 정보를 바탕으로 분할된 영역에 선택적인 타일링 패턴을 적용함으로써 보다 현실적인 모자익 스타일화 결과를 보인다. 본 논문의 기술을 사용하여 별다른 사용자 간섭 없이 현실적인 모자익 타일 결과를 생성할 수 있다.",
            "size": 45
        },{
            "id": 3,
            "article_id": "ART001652171",
            "title_ko": "펄린 그라디언트 노이즈 기반 난수 오프셋 곡선 및 곡면 표현 기술",
            "author_name": "윤종철,이인권",
            "author_id": "CRT000460253,None",
            "journal_name": "한국 정보 과학회",
            "pub_year": 2012,
            "citation": 0,
            "category": "CS",
            "abstract_ko": "본 논문에서는 모델의 세부적인 형태를 보다 손쉽고 자연스러운 형태로 제어 가능한 난수 오프셋기반의 새로운 형태의 곡선 및 곡면 생성방식을 제안한다. 본 논문의 기반이 되는 기술인 펄린의 편향치 노이즈함수는, 주어진 기반형태에, 보다 자세한 난수기반의 세부표현을 추가하는 방법으로 사용 될 수 있다. 본 논문에서는 이러한 노이즈함수에 대한 제어기법을 모델링 결과에 적용하여, 모델링 과정에서 세부적 형태를 보다 쉽게 표현하며 제어하는 두 가지 기법을 제안한다. 첫 번째 기법은 노이즈 함수의 지역적 제어기법을 사용하여 세부적인 형태에 대한 통계적 패턴 기반의 제어 기법을 제공하며, 두 번째로 기존에 존재하는 세부적 형태를 노이즈함수를 사용하여 추출함으로, 세부적 형태를 재이용하는 방법을 소개한다. 본 논문의 방법을 사용하여 사용자는 보다 쉽게 자연스러운 형태의 모델링이 가능하며, 이를 사용하여 물리 시뮬레이션 결과와 유사한 결과 제작이 가능하다.",
            "size": 75
        },{
            "id": 4,
            "article_id": "ART001652182",
            "title_ko": "채널필터 기법을 이용한 효율적인 멀티채널 설계",
            "author_name": "조승철,유정석,김현숙,한선영",
            "author_id": "CRT000861026,CRT001470558,CRT001470560,CRT000303264",
            "journal_name": "한국 정보 과학회",
            "pub_year": 2012,
            "citation": 0,
            "category": "GP",
            "abstract_ko": "현재 IPTV 발전은 단순히 영상을 전달하는 것이 아닌 사용자가 원하는 데이터 및 정보를 제공하는 수준까지 도달 하였다. 사용자들이 원하는 정보 및 영상을 제공하기 위해서는 안정성이 확보된 멀티채널 기술이 필요하다. 멀티채널은 사용자가 원하는 모든 서비스를 동시에 제공하는 기술을 말한다. 하지만 현재 멀티채널을 IPTV에 적용하기에는 문제가 있다. 사용자가 원하는 많은 채널을 구성하기 위해서는 채널별 안정성이 가장 중요하다. 본 논문에서는 멀티채널의 안정성을 제공하기 위하여 CF(Channel Filter) 기법을 제안하고 성능을 측정하고자 한다.",
            "size": 60
        },
        {
            "id": 5,
            "article_id": "ART001652183",
            "title_ko": "스트리밍 서비스의 품질 향상을 위한 적응적 미디어 데이터 전송 제어 기법",
            "author_name": "박정현,김동칠,이정민,정광수",
            "author_id": "CRT001466067,CRT001288726,CRT000456745,CRT000300952",
            "journal_name": "미국 정보 과학회",
            "pub_year": 2012,
            "citation": 1,
            "category": "AI",
            "abstract_ko": "모바일 단말과 광대역 무선 네트워크 기술의 발달로 인해 멀티미디어 스트리밍 서비스에 대한 사용자의 관심과 수요가 증가하고 있다. 하지만, 광대역 무선 네트워크는 멀티미디어 서비스 보급에 있어 확장형 비디오 부호화 기술의 특성 및 무선 네트워크 상태를 고려하지 못하여 사용자의 서비스 품질을 저하시키는 문제점을 가지고 있다. 이를 해결하기 위해 본 논문에서는 콘텐츠 특성과 무선 네트워크 상태를 고려한 미디어 데이터 전송 제어 기법인 HDC-ARQ(Hybrid Delay and Content-aware ARQ)를 제안하였다. HDC-ARQ 기법은 확장형 비디오 부호화 기술의 특성을 고려하여 ARQ(Automatic Repeat reQuest) 재전송 횟수를 차등적으로 조절하고, 네트워크 상태와 비디오 재생지연한계를 기반으로 미디어의 프레임을 선택적으로 폐기한다. 또한, 응용계층에서 미디어 프레임의 복잡도에 따라 차등적인 FEC (Forward Error Correction) 기법을 적용한다. 제안한 기법의 시뮬레이션 결과를 통해 스트리밍 서비스의 품질 향상을 확인하였다.",
            "size": 15
        }
    ],
    "links": [
        { "source": 0, "target": 1, "distance": 70 },
        { "source": 1, "target": 2, "distance": 80 },
        { "source": 2, "target": 3, "distance": 90 },
        { "source": 3, "target": 4, "distance": 100 },
        { "source": 4, "target": 0, "distance": 110 },
        { "source": 5, "target": 0, "distance": 120 },
        { "source": 2, "target": 1, "distance": 140 },
        { "source": 3, "target": 1, "distance": 130 },
        { "source": 4, "target": 2, "distance": 90 }
    ]
}